In [78]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
from scipy import stats
import datetime
import os


from sklearn.metrics import mean_squared_error
from sklearn.metrics import mean_absolute_error

In [25]:
filename = "../data/Alcohol_Sales.csv"
img_path = '../plots/forecasting/'

In [42]:
df_sales = pd.read_csv(filename, parse_dates=['DATE'])
display(df_sales.head)
display(df_sales.describe())

<bound method NDFrame.head of           DATE  S4248SM144NCEN
0   1992-01-01            3459
1   1992-02-01            3458
2   1992-03-01            4002
3   1992-04-01            4564
4   1992-05-01            4221
..         ...             ...
320 2018-09-01           12396
321 2018-10-01           13914
322 2018-11-01           14174
323 2018-12-01           15504
324 2019-01-01           10718

[325 rows x 2 columns]>

       S4248SM144NCEN
count      325.000000
mean      7886.400000
std       2914.269061
min       3031.000000
25%       5231.000000
50%       7481.000000
75%       9977.000000
max      15504.000000

In [43]:

df_sales.index = df_sales['DATE']
df_sales = df_sales.drop(['DATE'], axis=1)
df_sales.index = df_sales.index.rename('time')
display(df_sales)
display(df_sales.describe())
df_sales = df_sales.rename(columns={"S4248SM144NCEN": "Sales"})
sales_title = df_sales.columns[0]
df_sales.isna().sum()

            S4248SM144NCEN
time
1992-01-01            3459
1992-02-01            3458
1992-03-01            4002
1992-04-01            4564
1992-05-01            4221
...                    ...
2018-09-01           12396
2018-10-01           13914
2018-11-01           14174
2018-12-01           15504
2019-01-01           10718

[325 rows x 1 columns]

       S4248SM144NCEN
count      325.000000
mean      7886.400000
std       2914.269061
min       3031.000000
25%       5231.000000
50%       7481.000000
75%       9977.000000
max      15504.000000

Sales    0
dtype: int64

In [44]:
df_sales_arima = df_sales.copy()

In [79]:
# Useful functions

def get_test_train_split(df, split=0.2):
    split_nb = int(len(df)*split)
    train, test = df.iloc[:-split_nb], df.iloc[-split_nb:]
    train.index = pd.to_datetime(train.index)
    test.index = pd.to_datetime(test.index)
    return train, test

def base_model(df):
    """Predict a  with previous observation"""
    data = df.values
    pred_data = np.roll(data, shift=1, axis=None)
    pred_data[0] = data[0]
    
    return pred_data

def model_evaluation(true_val, pred_val):
    """Get the Root Mean Square Error and Mean Absolute Error"""
    rmse = np.sqrt(mean_squared_error(true_val, pred_val))
    mae = mean_absolute_error(true_val, pred_val)
    return rmse, mae

In [58]:
train,test = get_test_train_split(df_sales_arima, 0.2)

In [65]:
display(train.head)

<bound method NDFrame.head of             Sales
time
1992-01-01   3459
1992-02-01   3458
1992-03-01   4002
1992-04-01   4564
1992-05-01   4221
...           ...
2013-04-01  10493
2013-05-01  12218
2013-06-01  11385
2013-07-01  11186
2013-08-01  11462

[260 rows x 1 columns]>

In [81]:

pred_train_base = base_model(train)
pred_test_base = base_model(test)
base_rmse_train, base_mae_train = model_evaluation(train['Sales'], pred_train_base)
base_rmse_test, base_mae_test = model_evaluation(test['Sales'], pred_test_base)
#print("Base model, rmse Train Error: ", base_rmse_train) 
#print("Base model, rmse Test Error: ", base_rmse_test) 


print('Train data')
print('Base model RMSE: ', base_rmse_train) # RMSE
print('Base model MAE: ', base_mae_train)  # MAE


print('\n')
print('Test data')
print('Base model RMSE: ', base_rmse_test) 
print('Base model MAE: ', base_mae_test)

Train data
Base model RMSE:  1088.2289086825012
Base model MAE:  756.1884615384615


Test data
Base model RMSE:  1999.1991781326226
Base model MAE:  1513.5692307692307

from sklearn.metrics import mean_squared_error
rmse = np.sqrt(mean_squared_error(test, preds))

sales_title